[Killed] BlockStatement
scripts/componets/product-list/product-card.js:3:32
 import { escapeHtml } from '../../utils/sanitize.js';
 
-function formatCurrency(value) {
-  const amount = Number(value);
-  if (Number.isNaN(amount)) {
-    return '$0';
-  }
-  return new Intl.NumberFormat('es-CO', {
-    style: 'currency',
-    currency: 'COP',
-    maximumFractionDigits: 0,
-  }).format(amount);
-}
+function formatCurrency(value) {}
 
 export function generateProductCard(product) {
killedBy: generateProductCard formats invalid prices as $0
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /product-purchase-price\">[^<]*\$0/
Received string:  "
  <div class=\"product-item\" data-product-id=\"3\">
    <div class=\"product-name\">Bujia</div>
    <div class=\"product-desc\">Producto</div>
    <div class=\"product-stock normal-stock\">1</div>

[Killed] ConditionalExpression
scripts/componets/product-list/product-card.js:5:7
 
 function formatCurrency(value) {
   const amount = Number(value);
-  if (Number.isNaN(amount)) {
+  if (false) {
     return '$0';
   }
killedBy: generateProductCard formats invalid prices as $0
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /product-purchase-price\">[^<]*\$0/
Received string:  "
  <div class=\"product-item\" data-product-id=\"3\">
    <div class=\"product-name\">Bujia</div>
    <div class=\"product-desc\">Producto</div>
    <div class=\"product-stock normal-stock\">1</div>

[Killed] BlockStatement
scripts/componets/product-list/product-card.js:5:29
 
 function formatCurrency(value) {
   const amount = Number(value);
-  if (Number.isNaN(amount)) {
-    return '$0';
-  }
+  if (Number.isNaN(amount)) {}
   return new Intl.NumberFormat('es-CO', {
     style: 'currency',
killedBy: generateProductCard formats invalid prices as $0
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /product-purchase-price\">[^<]*\$0/
Received string:  "
  <div class=\"product-item\" data-product-id=\"3\">
    <div class=\"product-name\">Bujia</div>
    <div class=\"product-desc\">Producto</div>
    <div class=\"product-stock normal-stock\">1</div>

[Killed] LogicalOperator
scripts/componets/product-list/product-card.js:16:24
 }
 
 export function generateProductCard(product) {
-  const stock = Number(product?.stock ?? 0);
+  const stock = Number(product?.stock && 0);
   const stockMin = Number(product?.stockMin ?? 0);
   const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
killedBy: generateProductCard marks normal stock when stock equals stockMin (boundary)
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "product-stock normal-stock"
Received string:    "
  <div class=\"product-item\" data-product-id=\"2\">
    <div class=\"product-name\">Aceite</div>
    <div class=\"product-desc\">Producto</div>
    <div class=\"product-stock low-stock\">0</div>

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:16:24
 }
 
 export function generateProductCard(product) {
-  const stock = Number(product?.stock ?? 0);
+  const stock = Number(product.stock ?? 0);
   const stockMin = Number(product?.stockMin ?? 0);
   const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;

[Killed] LogicalOperator
scripts/componets/product-list/product-card.js:17:27
 
 export function generateProductCard(product) {
   const stock = Number(product?.stock ?? 0);
-  const stockMin = Number(product?.stockMin ?? 0);
+  const stockMin = Number(product?.stockMin && 0);
   const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
 
killedBy: generateProductCard marks low stock when stockMin is greater than stock
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "product-stock low-stock"
Received string:    "
  <div class=\"product-item\" data-product-id=\"1\">
    <div class=\"product-name\">Filtro</div>
    <div class=\"product-desc\">Producto</div>
    <div class=\"product-stock normal-stock\">2</div>

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:17:27
 
 export function generateProductCard(product) {
   const stock = Number(product?.stock ?? 0);
-  const stockMin = Number(product?.stockMin ?? 0);
+  const stockMin = Number(product.stockMin ?? 0);
   const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
 

[Killed] EqualityOperator
scripts/componets/product-list/product-card.js:18:39
 export function generateProductCard(product) {
   const stock = Number(product?.stock ?? 0);
   const stockMin = Number(product?.stockMin ?? 0);
-  const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
+  const classStock = `product-stock ${stockMin >= stock ? 'low-stock' : 'normal-stock'}`;
 
   const safeName = escapeHtml(product?.nombre);
killedBy: generateProductCard marks normal stock when stock equals stockMin (boundary)
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "product-stock normal-stock"
Received string:    "
  <div class=\"product-item\" data-product-id=\"2\">
    <div class=\"product-name\">Aceite</div>
    <div class=\"product-desc\">Producto</div>
    <div class=\"product-stock low-stock\">5</div>

[Killed] ConditionalExpression
scripts/componets/product-list/product-card.js:18:39
 export function generateProductCard(product) {
   const stock = Number(product?.stock ?? 0);
   const stockMin = Number(product?.stockMin ?? 0);
-  const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
+  const classStock = `product-stock ${false ? 'low-stock' : 'normal-stock'}`;
 
   const safeName = escapeHtml(product?.nombre);
killedBy: generateProductCard marks low stock when stockMin is greater than stock
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "product-stock low-stock"
Received string:    "
  <div class=\"product-item\" data-product-id=\"1\">
    <div class=\"product-name\">Filtro</div>
    <div class=\"product-desc\">Producto</div>
    <div class=\"product-stock normal-stock\">2</div>

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:20:31
   const stockMin = Number(product?.stockMin ?? 0);
   const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
 
-  const safeName = escapeHtml(product?.nombre);
+  const safeName = escapeHtml(product.nombre);
   const safeDescription = escapeHtml(product?.descripcion || 'Sin descripción');
   const safePurchasePrice = formatCurrency(product?.precioCompra);

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:21:38
   const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
 
   const safeName = escapeHtml(product?.nombre);
-  const safeDescription = escapeHtml(product?.descripcion || 'Sin descripción');
+  const safeDescription = escapeHtml(product.descripcion || 'Sin descripción');
   const safePurchasePrice = formatCurrency(product?.precioCompra);
   const safeSellingPrice = formatCurrency(product?.precioVenta);

[Survived] ConditionalExpression
scripts/componets/product-list/product-card.js:21:38
   const classStock = `product-stock ${stockMin > stock ? 'low-stock' : 'normal-stock'}`;
 
   const safeName = escapeHtml(product?.nombre);
-  const safeDescription = escapeHtml(product?.descripcion || 'Sin descripción');
+  const safeDescription = escapeHtml(true);
   const safePurchasePrice = formatCurrency(product?.precioCompra);
   const safeSellingPrice = formatCurrency(product?.precioVenta);

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:22:44
 
   const safeName = escapeHtml(product?.nombre);
   const safeDescription = escapeHtml(product?.descripcion || 'Sin descripción');
-  const safePurchasePrice = formatCurrency(product?.precioCompra);
+  const safePurchasePrice = formatCurrency(product.precioCompra);
   const safeSellingPrice = formatCurrency(product?.precioVenta);
 

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:23:43
   const safeName = escapeHtml(product?.nombre);
   const safeDescription = escapeHtml(product?.descripcion || 'Sin descripción');
   const safePurchasePrice = formatCurrency(product?.precioCompra);
-  const safeSellingPrice = formatCurrency(product?.precioVenta);
+  const safeSellingPrice = formatCurrency(product.precioVenta);
 
   return `

[Killed] StringLiteral
scripts/componets/product-list/product-card.js:25:10
   const safePurchasePrice = formatCurrency(product?.precioCompra);
   const safeSellingPrice = formatCurrency(product?.precioVenta);
 
-  return `
-  <div class="product-item" data-product-id="${escapeHtml(product?.id)}">
-    <div class="product-name">${safeName}</div>
-    <div class="product-desc">${safeDescription}</div>
-    <div class="${classStock}">${escapeHtml(stock)}</div>
-    <div class="product-purchase-price">${safePurchasePrice}</div>
-    <div class="product-selling-price">${safeSellingPrice}</div>
-    <div class="product-actions">
-      <button class="btn-edit product-actions-product" data-id="${escapeHtml(product?.id)}" data-action="edit">
-        <img class="img-edit" src="../assets/icons/edit.png" alt="Editar">
-      </button>
-      <button class="btn-delete product-actions-product" data-id="${escapeHtml(product?.id)}" data-action="delete">
-        <img class="img-delete" src="../assets/icons/delete.png" alt="Eliminar">
-      </button>
-    </div>
-  </div>`;
+  return ``;
 }
killedBy: generateProductCard marks low stock when stockMin is greater than stock
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "product-stock low-stock"
Received string:    ""

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:26:59
   const safeSellingPrice = formatCurrency(product?.precioVenta);
 
   return `
-  <div class="product-item" data-product-id="${escapeHtml(product?.id)}">
+  <div class="product-item" data-product-id="${escapeHtml(product.id)}">
     <div class="product-name">${safeName}</div>
     <div class="product-desc">${safeDescription}</div>

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:33:78
     <div class="product-purchase-price">${safePurchasePrice}</div>
     <div class="product-selling-price">${safeSellingPrice}</div>
     <div class="product-actions">
-      <button class="btn-edit product-actions-product" data-id="${escapeHtml(product?.id)}" data-action="edit">
+      <button class="btn-edit product-actions-product" data-id="${escapeHtml(product.id)}" data-action="edit">
         <img class="img-edit" src="../assets/icons/edit.png" alt="Editar">
       </button>

[Survived] OptionalChaining
scripts/componets/product-list/product-card.js:36:80
       <button class="btn-edit product-actions-product" data-id="${escapeHtml(product?.id)}" data-action="edit">
         <img class="img-edit" src="../assets/icons/edit.png" alt="Editar">
       </button>
-      <button class="btn-delete product-actions-product" data-id="${escapeHtml(product?.id)}" data-action="delete">
+      <button class="btn-delete product-actions-product" data-id="${escapeHtml(product.id)}" data-action="delete">
         <img class="img-delete" src="../assets/icons/delete.png" alt="Eliminar">
       </button>
